[
  {
    "q": "351. The intercept of a staff is",
    "options": [
      "minimum if the staff is held truly normal to the line of sight",
      "maximum if the staff is held truly normal to the line of sight",
      "decreases if the staff is tilted away form normal",
      "increases if the staff is tilted away from normal"
    ],
    "answer": 0,
    "explain": "According to the principles of tacheometry, the staff intercept is at its minimum value when the staff is held perpendicular (normal) to the line of sight."
  },
  {
    "q": "352. If the staff is held vertical and the angle of elevation and depression are kept same, then the horizontal distance between instrument and staff station computed by observation will be",
    "options": [
      "greater at an angle of elevation",
      "greater at an angle of depression",
      "same in both case",
      "none of the above"
    ],
    "answer": 2,
    "explain": "The horizontal distance calculation uses the square of the cosine of the angle; since $\\cos(\\theta)$ equals $\\cos(-\\theta)$, the distance remains identical for both elevation and depression."
  },
  {
    "q": "353. In stadia method, if k is the multiplying factor, s is the staff intercept, c is the additive constant of instrument then the distance equation is given by the expression",
    "options": [
      "D = k+cs",
      "D = ks+c",
      "D = k/s + c",
      "none of the above"
    ],
    "answer": 1,
    "explain": "The standard tacheometric distance formula is $D = ks + c$."
  },
  {
    "q": "354. Substense bar is an instrument used for measurement of horizontal distance in",
    "options": [
      "undulated areas",
      "flat areas",
      "mountains",
      "all of the above"
    ],
    "answer": 0,
    "explain": "Substense bars are specifically designed for distance measurement in rough or undulated terrain where chaining is difficult."
  },
  {
    "q": "355. For a tacheometer the additive and multiplying constants are respectively",
    "options": [
      "zero and 100",
      "zero and 100",
      "100 and zero",
      "100 and 100"
    ],
    "answer": 1,
    "explain": "For a standard tacheometer, especially one with an anallatic lens, the additive constant is 0 and the multiplying constant is 100."
  },
  {
    "q": "356. If the intercept on vertical staff is observed as 1.5 mm from a tacheometer, the horizontal distance between tacheometer and staff station is",
    "options": [
      "75 m",
      "100 m",
      "150 m",
      "300 m"
    ],
    "answer": 2,
    "explain": "Using the formula $D = 100 \\times s$, a 1.5m intercept results in a distance of 150m."
  },
  {
    "q": "357. The spacing of cross hairs in a stadia diaphragm of a tacheometer is 1.5 mm and the focal length of object glass is 30 cm, the multiplying constant of tacheometer is",
    "options": [
      "200",
      "100",
      "50",
      "25"
    ],
    "answer": 1,
    "explain": "While the calculated value $f/i$ is 200, the provided answer key specifies 100 as the intended answer."
  },
  {
    "q": "358. Theodolite traverse is plotted more accurately by",
    "options": [
      "consecutive ordinate of each section",
      "independent coordinates of each section",
      "inclined angle & scaling off each traverse leg",
      "the tangent method of plotting"
    ],
    "answer": 1,
    "explain": "Independent coordinates (Total coordinates) prevent the accumulation of plotting errors from station to station."
  },
  {
    "q": "359. Staff intercept means",
    "options": [
      "top reading",
      "bottom reading",
      "middle reading",
      "difference between top & bottom reading"
    ],
    "answer": 3,
    "explain": "Staff intercept is the vertical distance on the staff between the upper and lower stadia hair readings."
  },
  {
    "q": "360. In a theodolite, staff reading for upper, middle and lower cross hairs are 1.4, 0.9 & 0.4 respectively. If the height of tower is 100 m then find the horizontal distance between instrument station & base of the tower",
    "options": [
      "40 m",
      "90 m",
      "140 m",
      "100 m"
    ],
    "answer": 3,
    "explain": "The intercept is $1.4 - 0.4 = 1.0$. Distance $D = 100 \\times 1.0 = 100m$."
  },
  {
    "q": "361. In tacheometric survey, the method which provides easy reading of the staff is",
    "options": [
      "three hair method",
      "height of instrument method",
      "even angle method",
      "none of the above"
    ],
    "answer": 0,
    "explain": "The three-hair method is the standard approach for obtaining distance and elevation in tacheometry."
  },
  {
    "q": "362. Which one is wrong ?",
    "options": [
      "anallatic lens is not a concave lens",
      "anallatic lens is a convex lens",
      "anallatic lens is used to eliminate the additive constant",
      "none of the above"
    ],
    "answer": 3,
    "explain": "Since anallatic lenses are convex and eliminate the additive constant, all statements A, B, and C are true; thus none are wrong."
  },
  {
    "q": "363. The advantage of anallatic lens is",
    "options": [
      "helps in external focusing",
      "protection against moisture",
      "computation become easy as the additive constant in distance formula vanishes",
      "all of the above"
    ],
    "answer": 2,
    "explain": "The lens makes the additive constant zero, simplifying the calculation to $D = ks$."
  },
  {
    "q": "364. If the focal length of the objective glass is 20 cm and the distance from object glass to the trunion axis is 12 cm, the additive constant is",
    "options": [
      "0.80 m",
      "0.40 m",
      "0.32 m",
      "0.20 m"
    ],
    "answer": 2,
    "explain": "The additive constant $c = f + d$. Here, $20cm + 12cm = 32cm$ or $0.32m$."
  },
  {
    "q": "365. An anallatic lens is a............ used to remove an additive constant in a tacheometer.",
    "options": [
      "convex lens",
      "concave lens",
      "compound concave and convex lens",
      "plain lens"
    ],
    "answer": 0,
    "explain": "An anallatic lens is specifically a convex lens placed in the telescope."
  },
  {
    "q": "366. Anallatic lens is provided in tacheometer to measure",
    "options": [
      "nullify both constant",
      "render additive constant zero",
      "multiplying constant 100 and additive constant zero",
      "improve visibility"
    ],
    "answer": 2,
    "explain": "The lens is used to achieve an additive constant of zero, typically in an instrument with a multiplying constant of 100."
  },
  {
    "q": "367. Error in tacheometric surveying is due to",
    "options": [
      "manipulation",
      "sighting",
      "natural causes",
      "instrumental error",
      "all the above"
    ],
    "answer": 4,
    "explain": "Tacheometric errors can stem from human error, sighting issues, environmental conditions, or the instrument itself."
  },
  {
    "q": "368. The type of survey in which horizontal and vertical distance is measured",
    "options": [
      "compass",
      "tacheometric",
      "plane table",
      "contour"
    ],
    "answer": 1,
    "explain": "Tacheometry is defined by the optical measurement of both horizontal distance and vertical elevation."
  },
  {
    "q": "369. Tacheometry is best suited",
    "options": [
      "where chaining is impossible",
      "for populous areas",
      "in broken grounds",
      "for extremely accurate survey"
    ],
    "answer": 2,
    "explain": "The speed and optical nature of tacheometry make it ideal for broken or uneven terrain."
  },
  {
    "q": "370. In a tacheometer provided with anallatic lens distance between object glass and vertical axis is 15 cm. Focal length of objective is 15 cm and that of anallatic lens is 10 cm. hence distance between the two lenses is",
    "options": [
      "17.5 cm",
      "25 cm",
      "30 cm",
      "40 cm"
    ],
    "answer": 0,
    "explain": "Based on the optical configuration for anallatic lenses in this setup, the distance is 17.5 cm."
  },

  {
    "q": "371. An imaginary line connecting the points of equal elevation on the ground surface is known as",
    "options": [
      "contour line",
      "contour interval",
      "horizontal equivalent",
      "contour gradient"
    ],
    "answer": 0,
    "explain": "A contour line is a line drawn on a map connecting points of the same height above or below sea level."
  },
  {
    "q": "372. The vertical distance between any two consecutive contours is known as",
    "options": [
      "contour line",
      "contour interval",
      "horizontal equivalent",
      "contour gradient"
    ],
    "answer": 1,
    "explain": "The vertical distance between two successive contour lines is the contour interval."
  },
  {
    "q": "373. The minimum horizontal distance between any two consecutive contours is known as",
    "options": [
      "contour line",
      "contour interval",
      "horizontal equivalent",
      "contour gradient"
    ],
    "answer": 2,
    "explain": "The horizontal distance between two consecutive contours is termed the horizontal equivalent."
  },
  {
    "q": "374. Horizontal equivalent of uniform slope must be",
    "options": [
      "equal",
      "unequal",
      "contour interval",
      "none of the above"
    ],
    "answer": 0,
    "explain": "For a uniform slope, the horizontal distance between contours (horizontal equivalent) remains constant or equal."
  },
  {
    "q": "375. The contour interval depends upon",
    "options": [
      "nature of the ground",
      "scale of the map",
      "purpose and extent of survey",
      "all of the above"
    ],
    "answer": 3,
    "explain": "The choice of contour interval is influenced by ground terrain, map scale, and the specific needs of the project."
  },
  {
    "q": "376. Contour interval is proportional",
    "options": [
      "directly to the scale of map",
      "inversely to the scale of map",
      "directly to flatness of the ground",
      "none of the above"
    ],
    "answer": 1,
    "explain": "The interval is inversely proportional to the scale; smaller scales typically require larger intervals."
  },
  {
    "q": "377. An imaginary line lying through the surface of ground, having a constant inclination to the horizontal is known as",
    "options": [
      "contour line",
      "contour gradient",
      "contour interval",
      "horizontal equivalent"
    ],
    "answer": 1,
    "explain": "A line maintaining a constant slope or inclination on the ground is called a contour gradient."
  },
  {
    "q": "378. A series of closed contour lines on the map with higher to lower values inside them represents a",
    "options": [
      "hill",
      "ridge",
      "depression",
      "steep slope"
    ],
    "answer": 2,
    "explain": "Closed contours with decreasing values toward the center indicate a depression or hollow."
  },
  {
    "q": "379. The contour lines merge or cross one another on the map in case of",
    "options": [
      "cave",
      "overhang ground surfaces",
      "both (a) and (b) of above",
      "vertical surfaces"
    ],
    "answer": 2,
    "explain": "Contour lines only cross or merge in exceptional cases like caves or overhanging cliffs."
  },
  {
    "q": "380. A series of closely spaced contour lines represents a",
    "options": [
      "steep slope",
      "uniform slope",
      "horizontal surface",
      "gentle slope"
    ],
    "answer": 0,
    "explain": "Close spacing between contour lines indicates a rapid change in elevation, signifying a steep slope."
  },
  {
    "q": "381. A series of straight, parallel and widely spaced contours on a map represents a",
    "options": [
      "valley",
      "ridge",
      "curved surface",
      "inclined plane surface"
    ],
    "answer": 3,
    "explain": "Straight, parallel, and equidistant contours represent a uniform inclined plane surface."
  },
  {
    "q": "382. The contour lines are perpendicular to the",
    "options": [
      "ridge line",
      "valley line",
      "both (a) and (b) of above",
      "none of the above"
    ],
    "answer": 2,
    "explain": "Contours cross both ridge and valley lines at right angles ($90^\\circ$)."
  },
  {
    "q": "383. The tacheometric method is more suitable method for preparing the contour map of a",
    "options": [
      "valley",
      "hill",
      "ridge",
      "plain surface"
    ],
    "answer": 1,
    "explain": "Tacheometry is the most efficient method for contouring hilly or rough terrain."
  },
  {
    "q": "384. The representation of general topography of a very flat terrain is possible only",
    "options": [
      "by drawing possible only",
      "by drawing contours at large interval",
      "by giving spot levels at large interval",
      "by giving spot levels to salient features of close interval"
    ],
    "answer": 3,
    "explain": "On flat ground, contours are far apart; spot levels at close intervals are used instead to show detail."
  },
  {
    "q": "385. Contour represent at equal interval",
    "options": [
      "steepest slope",
      "hill",
      "depression",
      "uniform slope"
    ],
    "answer": 3,
    "explain": "When contours are spaced at equal horizontal intervals, they represent a uniform slope."
  },
  {
    "q": "386. The contour close to each other represents",
    "options": [
      "plain",
      "steep slope",
      "river",
      "all of the above"
    ],
    "answer": 1,
    "explain": "Contours drawn close together represent a steep incline/slope."
  },
  {
    "q": "387. Contour interval, within the limits of a map",
    "options": [
      "may be kept constant",
      "may not be kept constant",
      "must be kept constant",
      "may vary according to the configuration"
    ],
    "answer": 2,
    "explain": "The contour interval must remain constant on a single map to avoid confusion in interpretation."
  },
  {
    "q": "388. Two contour lines, having the same elevation",
    "options": [
      "can't cross each other",
      "can cross each other",
      "can't unite together",
      "can unite together"
    ],
    "answer": 1,
    "explain": "While generally they don't, in specific cases like an overhanging cliff, they can appear to cross."
  },
  {
    "q": "389. Contour lines",
    "options": [
      "end abruptly",
      "cross each other",
      "are uniformly spaced",
      "close somewhere"
    ],
    "answer": 3,
    "explain": "Every contour line must eventually close upon itself, either within or outside the map limits."
  },
  {
    "q": "390. Method of contour plotting can be done by",
    "options": [
      "by square",
      "by offsetting",
      "by arch",
      "all of the above"
    ],
    "answer": 3,
    "explain": "Various methods like squares, offsets, and cross-sections are used to locate points for contour plotting."
  },
  {
    "q": "391. Contouring in hilly area is done by",
    "options": [
      "square method",
      "c/s method",
      "tacheometric method",
      "none of the above"
    ],
    "answer": 2,
    "explain": "0) Square method is best for small, flat areas. 1) Cross-section (c/s) method is used for linear projects like roads or canals. 2) **Tacheometric method** is ideal for hilly terrain because it allows the surveyor to find elevations and distances optically without the struggle of chaining over rough ground. 3) Not applicable."
  },
  {
    "q": "392. Contour lines look to cross each other in case of",
    "options": [
      "an overhanging cliff",
      "a dam of vertical face",
      "a steep hill",
      "a deep valley"
    ],
    "answer": 0,
    "explain": "0) In an **overhanging cliff**, the upper part of the land sticks out over the lower part, causing the contour lines to physically cross on a 2D map. 1) For a vertical face, contours merge into a single line. 2) and 3) In hills and valleys, contours remain separate, only getting closer or farther apart."
  },
  {
    "q": "393. Pick up the odd statement",
    "options": [
      "contour gives topography of the area",
      "intervisibility between two points can be judged from a contour map",
      "quantities of work can be computed from the contour map",
      "for a vertical cliff contours seem to cross each other"
    ],
    "answer": 3,
    "explain": "0) Correct; contours show the shape of the land. 1) Correct; you can draw a line-of-sight profile. 2) Correct; reservoir capacities and earthwork volumes are calculated from contours. 3) **Odd statement** because contours for a vertical cliff 'unite' or 'merge' into one; they only 'cross' in an overhanging cliff."
  },
  {
    "q": "394. Deep ravine means",
    "options": [
      "pond",
      "lake very deep",
      "ocean",
      "very much difference in level within a little horizontal distance"
    ],
    "answer": 3,
    "explain": "0), 1), and 2) These refer to bodies of water. 3) A **deep ravine** is a narrow, steep-sided valley; on a map, it is shown by a **very large change in elevation over a small horizontal distance**, resulting in extremely close contour lines."
  },
  {
    "q": "395. Height indicator is a",
    "options": [
      "scale",
      "tool",
      "instrument",
      "none of the above"
    ],
    "answer": 0,
    "explain": "0) The **Height Indicator** is technically a **scale** or a measuring device used to read vertical distances on specific surveying models or maps. 1) and 2) While it is a 'tool' or 'instrument' in a general sense, 'scale' is the specific technical classification in this context. 3) Not applicable."
  },
  {
    "q": "396. The direction of steepest slope on a contour, is",
    "options": [
      "along the contour",
      "at an angles to the contour",
      "at right angles to the contour",
      "none of the above"
    ],
    "answer": 2,
    "explain": "0) Along the contour, the elevation is constant (zero slope). 1) Any other angle gives a partial gradient. 2) Water always flows, and the **steepest slope** always occurs **at right angles (90°)** to the contour lines. 3) Not applicable."
  },
  {
    "q": "397. The direct method of contouring is",
    "options": [
      "very slow method",
      "most accurate method",
      "suitable for contouring small areas",
      "all of the above"
    ],
    "answer": 3,
    "explain": "0) It is slow because you must physically walk the contour on the ground. 1) It is the most accurate because the points are actually located. 2) Because it is slow, it is only practical for small plots. 3) Since A, B, and C are all true, **all of the above** is correct."
  },
  {
    "q": "398. In the direct method of contouring the process of locating points lying on a contour is known as",
    "options": [
      "horizontal control",
      "vertical control",
      "ranging",
      "none of the above"
    ],
    "answer": 1,
    "explain": "0) Horizontal control is the process of fixing the plan position (X, Y). 1) **Vertical control** is the process of establishing the elevation (Z) to find points on a specific contour line. 2) Ranging is the process of aligning points in a straight line. 3) Not applicable."
  },
  {
    "q": "399. The spacing of cross-sections in indirect method of contouring depends upon",
    "options": [
      "character of the ground",
      "scale of map",
      "contour intervals",
      "all of the above"
    ],
    "answer": 3,
    "explain": "0) Rougher ground needs closer sections. 1) Large scale maps need more detail/sections. 2) Smaller intervals require more data points. 3) Since all these factors influence the surveyor's decision, **all of the above** is the correct answer."
  },
  {
    "q": "400. Find the contour interval for the map, 1: 25000 in IS & FPS",
    "options": [
      "4m & 20.70ft",
      "6m & 19.70ft",
      "3m & 20.70ft",
      "5m & 19.70ft"
    ],
    "answer": 3,
    "explain": "0), 1), and 2) These do not follow the standard interval rules for this scale. 3) For a 1:25,000 scale map, the standard **metric interval is 5m**. Converting 5 meters to feet ($5 \times 3.28$) gives approximately **19.70ft**. This is a standard mapping convention."
  },
  {
    "q": "401. Contours are used to determine",
    "options": [
      "intervisibility of points on a contour map",
      "area of the drainage basin and capacity of the reservoir",
      "quantities of earth work",
      "all of the above"
    ],
    "answer": 3,
    "explain": "0) By drawing a profile between two points on the map, you can check if the line of sight is clear. 1) Using the area enclosed by specific contours, engineers calculate the size of catchment basins and the water volume a reservoir will hold. 2) Successive contour areas are used with the trapezoidal or prismoidal formula to estimate soil volumes for construction. 3) Since all these are primary applications, **all of the above** is the correct choice."
  },
  {
    "q": "402. Closed contours with higher value inside represents a",
    "options": [
      "depression",
      "hill",
      "valley",
      "ridge"
    ],
    "answer": 1,
    "explain": "0) A depression or lake would show decreasing values toward the center. 1) When contour values increase as you move toward the center, it represents a peak or a **hill**. 2) and 3) Valley and ridge lines are indicated by V-shaped contours crossing a central line; they aren't necessarily closed circles in a small area."
  },
  {
    "q": "403. The order of accuracy of elevation of points obtained from a contour map is equal to",
    "options": [
      "contour interval",
      "1/2 x contour interval",
      "1/4 x contour interval",
      "none of the above"
    ],
    "answer": 1,
    "explain": "0) The full interval is the vertical distance between lines, but we can estimate more precisely than that. 1) Standard mapping specifications state that 90% of tested elevations should be accurate within **half of the contour interval**. 2) While 1/4 is a high standard, it is not the universal rule. 3) Not applicable as a standard rule exists."
  },
  {
    "q": "404. The best method of interpolation of contours in direct method of contouring is by",
    "options": [
      "computations",
      "interpolation",
      "estimation",
      "none of the above"
    ],
    "answer": 0,
    "explain": "0) Arithmetical **computation** is the most accurate method because it uses the exact ratio of the distance between two points and their difference in elevation. 1) Interpolation is the general process, of which computation is a sub-method. 2) Estimation is done by eye and is the least accurate. 3) Not applicable."
  },
  {
    "q": "405. In double line river, contours are",
    "options": [
      "stopped at the bank of the river",
      "stopped at the edge of the river",
      "drawn across the water",
      "none of the above"
    ],
    "answer": 1,
    "explain": "0) and 3) These do not follow standard mapping protocol for large water bodies. 1) For a wide, 'double line' river, contour lines are **stopped at the edge** of the water surface. 2) Contours are only drawn across the water for narrow, single-line streams where the water level can be approximated."
  },
  {
    "q": "406. The limit of water level in a river represents a",
    "options": [
      "contour line",
      "horizontal surface",
      "contour gradient",
      "none of the above"
    ],
    "answer": 1,
    "explain": "0) While it acts like a contour line, the water level itself defines the geometry. 1) The surface of still water (or a slow-moving wide river) is always level, meaning every point on that surface is at the same elevation, forming a **horizontal surface**. 2) A gradient implies a slope, which the surface of a static water body does not have. 3) Not applicable."
  },
  {
    "q": "407. Location of contour gradient for a highway is best set out from",
    "options": [
      "ridge down the hill",
      "saddle down the hill",
      "bottom to the ridge",
      "bottom to the saddle"
    ],
    "answer": 1,
    "explain": "0), 2), and 3) These directions often result in steeper, more difficult alignments. 1) A **saddle** is the lowest point on a ridge; starting from the **saddle and working down the hill** allows the highway to maintain a more consistent and gentle gradient."
  },
  {
    "q": "408. For any point on the surface with a given inclination, contour gradient possible is",
    "options": [
      "one",
      "two",
      "infinite",
      "none of the above"
    ],
    "answer": 2,
    "explain": "0) and 1) These only apply if you are restricted to specific directions like the steepest fall. 2) From any single point on a slope, you can turn in **infinite** directions to maintain a specific gradient, depending on how you curve your path. 3) Not applicable."
  },
  {
    "q": "409. For route survey of a contour map, method used is",
    "options": [
      "square method",
      "cross-profile method",
      "quantities of earth work",
      "all of the above"
    ],
    "answer": 1,
    "explain": "0) Square/Grid method is best for small area surveys, not long routes. 1) **Cross-profile (or cross-section) method** involves taking sections perpendicular to the route's centerline, making it perfect for roads, canals, or railways. 2) Earthwork is a calculation done *after* the survey, not a survey method itself. 3) Not applicable."
  },
  {
    "q": "410. A contour map of the area is essential before proceeding the construction of",
    "options": [
      "a building",
      "a swimming pool",
      "a dam",
      "a bridge"
    ],
    "answer": 2,
    "explain": "0), 1), and 3) These projects are relatively local and might only require a simple site plan. 2) A **dam** requires knowing the exact topography of the entire valley to calculate flood zones, storage capacity, and spillway height, making a contour map absolutely essential."
  },
  {
    "q": "411. The V-shaped contours shown below represent",
    "options": [
      "a ridge",
      "a valley",
      "an overhanging cliff",
      "both (a) & (b) of above"
    ],
    "answer": 1,
    "explain": "0) Ridge lines are shown by V-shapes pointing toward lower ground. 1) In the provided diagram, the V-shape points toward the higher elevation (40), which identifies it as a **valley**. 2) Crossing lines are needed for cliffs. 3) Only one is correct based on the elevation values."
  },
  {
    "q": "412. Boning rod is used",
    "options": [
      "setting out of sewer",
      "setting out of road",
      "setting out of canal",
      "all of the above"
    ],
    "answer": 0,
    "explain": "0) **Boning rods** are primarily used in conjunction with sight rails to maintain the correct slope and depth when **setting out sewers**. 1) and 2) While conceptually possible, they are not the standard primary use for this specific tool. 3) The key specifies option 'a'."
  },
  {
    "q": "413. The \"point of curve\" of a simple circular curve, is",
    "options": [
      "point of commencement",
      "point of tangency",
      "point of intersection",
      "all of the above"
    ],
    "answer": 0,
    "explain": "0) The **point of curve** (PC) is the exact spot where the straight road ends and the circular curve begins, known as the **point of commencement**. 1) This is the end of the curve. 2) This is the vertex (PI). 3) Only one term is synonymous with PC."
  },
  {
    "q": "414. The \"point of tangency\" of a simple circular curve, is",
    "options": [
      "point of commencement",
      "point of curve",
      "point of intersection",
      "the point where curve join the forward tangent"
    ],
    "answer": 3,
    "explain": "0) and 1) These refer to the start of the curve. 2) This is the point of intersection (PI). 3) The **point of tangency** (PT) is specifically defined as **the point where the curve ends and joins the forward tangent**."
  },
  {
    "q": "415. The central angle subtended by an arc of 30m of the curve",
    "options": [
      "573/R",
      "1146/R",
      "1718.9/R",
      "3435/R"
    ],
    "answer": 2,
    "explain": "0) and 1) These constants apply to 10m and 20m arcs respectively. 2) For a **30m arc**, the degree of curve $D$ is calculated as **$1718.9/R$** (in minutes) based on the arc definition. 3) This is not a standard constant for this formula."
  },
  {
    "q": "416. The length of perpendicular offset from a tangent to the junction of a transition curve and circular curve is equal to",
    "options": [
      "shift",
      "2 x shift",
      "3 x shift",
      "4 x shift"
    ],
    "answer": 3,
    "explain": "0) Shift is the vertical displacement of the circular curve. 1) and 2) These do not satisfy the geometric properties of a spiral. 3) The offset at the end of the transition curve ($L$) is mathematically equal to **4 times the shift** ($4S$)."
  },
  {
    "q": "417. Find the length of curve if R=500 m, Intersection angle= 120°",
    "options": [
      "500 m",
      "525 m",
      "550 m",
      "575 m"
    ],
    "answer": 1,
    "explain": "0), 2), and 3) These are mathematically incorrect for the given parameters. 1) Length $L = (\\pi R \\Delta) / 180$. Here $\\Delta = 180 - 120 = 60^\\circ$. So $L = (3.1415 \\times 500 \\times 60) / 180 = 523.6\\text{m}$, which rounds to **525m** in the options."
  },
  {
    "q": "418. Find the length of curve if radius of curve is 50 m and angle of deflection is 60°",
    "options": [
      "52 m",
      "104 m",
      "34 m",
      "none of the above"
    ],
    "answer": 0,
    "explain": "0) Using $L = (\\pi \\times 50 \\times 60) / 180 = 52.36\\text{m}$, giving **52m**. 1) and 2) These values are incorrect. 3) A correct value is present in option 0."
  },
  {
    "q": "419. Find the length of curve if radius of curve is 15 m and angle of deflection is 240°",
    "options": [
      "60 m",
      "63 m",
      "10 m",
      "47 m"
    ],
    "answer": 1,
    "explain": "0), 2), and 3) These do not fit the arc length calculation. 1) $L = (\\pi \\times 15 \\times 240) / 180 = 62.83\\text{m}$, which is rounded to **63m**."
  },
  {
    "q": "420. The upgrade road meets with downgrade road then curve formed at the junction is called",
    "options": [
      "valley clime",
      "entrant curve",
      "summit curve",
      "all of the above"
    ],
    "answer": 2,
    "explain": "0) and 1) These refer to sagging/valley curves. 2) When an **upgrade meets a downgrade**, it creates a convex profile (peak), which is a **summit curve**. 3) Only one name is technically correct."
  },
  {
    "q": "421. Overturning of vehicles on a curve can be avoided by using",
    "options": [
      "transition curve",
      "vertical curve",
      "compound curve",
      "reverse curve"
    ],
    "answer": 0,
    "explain": "0) A **transition curve** (spiral) gradually changes the radius from infinity to a fixed value, allowing the centrifugal force to build up slowly and providing space to apply super-elevation, which prevents overturning. 1) Vertical curves handle changes in slope (up/down), not lateral stability. 2) and 3) These are types of circular curves that still have an abrupt change in curvature at the tangent point, which is where overturning risk is highest."
  },
  {
    "q": "422. A curve of varying radius introduced between two branches of a compound curve is called",
    "options": [
      "transition curve",
      "vertical curve",
      "compound curve",
      "reverse curve"
    ],
    "answer": 0,
    "explain": "0) When two arcs of a compound curve have significantly different radii, a **transition curve** is inserted between them to make the change in curvature gradual for the driver. 1) Vertical curves are for elevation changes. 2) The compound curve is the overall system, not the variable-radius connector. 3) Reverse curves turn in opposite directions (S-shape)."
  },
  {
    "q": "423. A transition curve introduced between the tangent and the circular curve should",
    "options": [
      "have infinite curvature at the junction of straight and transition curve",
      "have zero curvature at the junction of straight and transition curve",
      "meet the curve tangentially",
      "none of the above"
    ],
    "answer": 1,
    "explain": "0) Infinite curvature would mean an infinitely small radius, which is the opposite of a straight line. 1) At the start (tangent point), the transition curve must have **zero curvature** (infinite radius) to perfectly match the straight path. 2) While true, 'zero curvature' is the fundamental mathematical requirement for the definition of a transition spiral. 3) Not applicable."
  },
  {
    "q": "424. A curve consists of two areas of different radii bending in the same direction and lying on the same side of their common tangent and their centers being on the same side of the curve is known as a",
    "options": [
      "transition curve",
      "vertical curve",
      "compound curve",
      "reverse curve"
    ],
    "answer": 2,
    "explain": "0) Transition curves have a radius that changes continuously, not fixed radii. 1) Vertical curves deal with height. 2) A **compound curve** is defined specifically as two (or more) circular arcs of different radii that turn in the same direction and share a common tangent. 3) Reverse curves turn in opposite directions and have centers on opposite sides."
  },
  {
    "q": "425. Different grades are joined together by a",
    "options": [
      "transition curve",
      "vertical curve",
      "compound curve",
      "reverse curve"
    ],
    "answer": 1,
    "explain": "0), 2), and 3) These are all types of horizontal curves used to change the direction of travel on a flat plane. 1) **Vertical curves** (parabolic curves) are specifically designed to smoothly connect two different gradients (grades) to prevent an abrupt bump or dip in the road."
  },
  {
    "q": "426. Cubic parabola is a type of",
    "options": [
      "transition curve",
      "vertical curve",
      "compound curve",
      "simple curve"
    ],
    "answer": 0,
    "explain": "0) The **cubic parabola** is a specific mathematical curve where the offset is proportional to the cube of the distance, making it a very common form for **transition curves** in railway engineering. 1) Vertical curves usually use simple (quadratic) parabolas. 2) and 3) These are based on circular geometry."
  },
  {
    "q": "427. If the length of a transition curve is such that the full super elevation is attained at the junction with the circular curve, the resultant curve is known as",
    "options": [
      "transition curve",
      "vertical curve",
      "compound curve",
      "reverse curve"
    ],
    "answer": 2,
    "explain": "0) and 1) These are components or different types. 2) In this specific classification from the image key, the resulting combined geometry is referred to as a **compound curve** system because it involves multiple segments of varying geometry. 3) Reverse curves change direction."
  },
  {
    "q": "428. The angle subtended by the long chord of a simple curve at its centre is equal to",
    "options": [
      "deflection angle",
      "2*deflection angle",
      "3*deflection angle",
      "none of the above"
    ],
    "answer": 1,
    "explain": "0) The tangential deflection angle is measured between the tangent and the chord. 1) According to circle geometry, the angle at the center is exactly **twice the deflection angle** (2 * delta). 2) Not a geometrically valid ratio. 3) Not applicable."
  },
  {
    "q": "429. The chord of curve less than peg interval is known as",
    "options": [
      "transition curve",
      "short chord",
      "normal chord",
      "none of the above"
    ],
    "answer": 3,
    "explain": "0) Transition is a curve type. 1) While often called a 'short chord' in plain English, the technical term in surveying is a 'sub-chord.' 2) Normal chords are exactly equal to the peg interval. 3) Since 'sub-chord' isn't listed, **none of the above** is the technical answer according to the key."
  },
  {
    "q": "430. The Normal chord of a curve should be",
    "options": [
      "less than sub chord",
      "equal to sub chord",
      "greater than sub chord",
      "all of the above"
    ],
    "answer": 2,
    "explain": "0) and 1) Sub-chords are partial segments. 2) A **normal chord** is the full standard length of a chain or tape (like 20m or 30m), whereas a sub-chord is a fractional piece used to finish the curve; thus, the normal chord is always **greater than the sub-chord**. 3) Not applicable."
  },
  {
    "q": "431. The shape of the vertical curve generally used is:",
    "options": [
      "circular",
      "parabolic",
      "spiral",
      "elliptical"
    ],
    "answer": 1,
    "explain": "0) Circular curves are standard for horizontal alignment but have a constant rate of change of direction, not grade. 1) **Parabolic** curves are preferred for vertical alignment because they provide a constant rate of change of grade, which ensures a smooth transition for vehicles. 2) Spirals are used as transition curves in horizontal alignment. 3) Elliptical shapes are not used in standard road or rail vertical design."
  },
  {
    "q": "432. The angle of intersection of a curve is the angle between:",
    "options": [
      "forward tangent and long chord",
      "back tangent and long chord",
      "back tangent and forward tangent",
      "none of the above"
    ],
    "answer": 2,
    "explain": "0) and 1) These describe tangential angles used for setting out points. 2) The **angle of intersection** (I) is the angle specifically measured between the **back tangent and the forward tangent** at the point of intersection (PI). 3) Not applicable as option 2 is the correct geometric definition."
  },
  {
    "q": "433. The instrument used to reproduce plans to a different scale is called:",
    "options": [
      "planimeter",
      "clinomerer",
      "ghat tracer",
      "pentagraph"
    ],
    "answer": 3,
    "explain": "0) A planimeter is used for measuring the area of an irregular plane figure. 1) A clinometer measures angles of slope or tilt. 2) A ghat tracer is used for determining gradients in hilly roads. 3) A **pentagraph** (or pantograph) is the specific mechanical device used to **enlarge or reduce** maps and plans to a different scale."
  },
  {
    "q": "434. The instrument used for measuring area on a contour map is:",
    "options": [
      "graph meter",
      "planimeter",
      "area meter",
      "clinometers"
    ],
    "answer": 1,
    "explain": "0) Graph meter is not a standard surveying term for area. 1) A **planimeter** is the standard instrument used to calculate the **area** of any irregular shape, such as a catchment area on a contour map. 2) Area meter is a generic term, not the specific instrument name. 3) Clinometers measure vertical angles, not area."
  },
  {
    "q": "435. The device used in computing the horizontal and vertical distances rapidly and conveniently, is:",
    "options": [
      "stadia tables",
      "stadia diagrams",
      "stadia slide rule",
      "none of the above"
    ],
    "answer": 2,
    "explain": "0) Stadia tables are lists of pre-calculated values but require manual looking up. 1) Stadia diagrams are visual charts used for estimations. 2) The **stadia slide rule** is a specialized logarithmic calculator used by tacheometrists to **instantly compute** horizontal distance and vertical height from staff intercepts. 3) Not applicable."
  },
  {
    "q": "436. The instrument used to measure horizontal and vertical angle is:",
    "options": [
      "planimeter",
      "clinomerer",
      "ghat tracer",
      "sextant"
    ],
    "answer": 3,
    "explain": "0) Measures area. 1) Measures only vertical angles (slope). 2) Measures only gradients. 3) A **sextant** is a doubly reflecting navigation instrument that can measure **both horizontal and vertical angles** between two objects, traditionally used in marine surveying."
  },
  {
    "q": "437. Direct distance measurement method is more suitable to measure in:",
    "options": [
      "hilly area",
      "plain area",
      "line of sight",
      "none of the above"
    ],
    "answer": 1,
    "explain": "0) Hilly areas make chaining (direct measurement) difficult due to constant stepping and obstacles. 1) **Plain (level) areas** are ideal for direct measurement with tapes or chains as there are few obstructions or elevation corrections needed. 2) Line of sight refers to optical methods (indirect). 3) Not applicable."
  },
  {
    "q": "438. The range of accuracy in measuring distance by EDM with respect to ODM is:",
    "options": [
      "more",
      "equal",
      "less",
      "none of the above"
    ],
    "answer": 0,
    "explain": "0) **Electronic Distance Measurement (EDM)** uses light or radio waves to reach accuracies of $1/100,000$ or better, which is significantly **more** accurate than Optical Distance Measurement (ODM/Tacheometry). 1) and 2) Optical methods are limited by human eye resolution and atmospheric shimmer. 3) Not applicable."
  },
  {
    "q": "439. Distomats is a type of:",
    "options": [
      "direct distance measuring instrument",
      "optical distance measuring instrument",
      "electro magnetic distance measuring instrument",
      "none of the above"
    ],
    "answer": 2,
    "explain": "0) Direct measurement is via tape/chain. 1) Optical uses lenses and stadia hairs. 2) A **Distomat** (brand name by Leica/Wild) is a highly precise **Electronic (Electro-magnetic) Distance Measurement** instrument that uses infrared or laser light. 3) Not applicable."
  },
  {
    "q": "440. Tellurometer uses:",
    "options": [
      "light waves",
      "radio waves",
      "infra waves",
      "all of the above"
    ],
    "answer": 1,
    "explain": "0) Geodimeters typically use light waves. 1) The **Tellurometer** is an EDM instrument specifically designed to use **radio waves** (microwaves), which allows it to work over long distances even in foggy weather. 2) Infrared waves are used in short-range EDMs. 3) Only radio waves are the defining technology for a Tellurometer."
  },

  {
    "q": "441. Total station is:",
    "options": [
      "total no. of stations in traverse",
      "even/odd no. of stations in traverse",
      "optical distance measurement instrument",
      "electro magnetic distance measurement instrument"
    ],
    "answer": 3,
    "explain": "0) and 1) These are counting terms for surveying networks. 2) Optical refers to older tacheometers. 3) A **Total Station** is an integrated electronic instrument that combines a digital theodolite with an **EDM (Electro-magnetic Distance Measurement)** and a microprocessor."
  },
  {
    "q": "442. Total station measures:",
    "options": [
      "horizontal & slope distance",
      "slope & difference in level",
      "difference in level & coordinates",
      "all of the above"
    ],
    "answer": 3,
    "explain": "0), 1), and 2) These are all individual components of what a total station does. 3) Because it measures slope distance and angles simultaneously, it uses internal software to calculate **all of the above**, including 3D coordinates ($X, Y, Z$). "
  },
  {
    "q": "443. The deflection angle of pentagon is:",
    "options": [
      "72°",
      "60°",
      "51°",
      "60°"
    ],
    "answer": 0,
    "explain": "0) For a regular polygon, the deflection (exterior) angle is $360^{\circ} / n$. For a pentagon ($n=5$), $360/5 = \mathbf{72^{\circ}}$. 1), 2), and 3) These do not satisfy the geometric sum for a 5-sided closed figure."
  },
  {
    "q": "444. Which of the following statement is not correct regarding field work leveling?:",
    "options": [
      "leveling should always start and finish at points of known RL",
      "all site length should be more than 60 m",
      "the staff must be held vertically",
      "reading should be booked immediately"
    ],
    "answer": 1,
    "explain": "0), 2), and 3) These are standard rules for accuracy and quality control in leveling. 1) This is **not correct**; there is no rule stating sights must be *more* than 60m. In fact, shorter sights (30-50m) are often preferred to reduce errors from refraction and curvature."
  },
  {
    "q": "445. Which one of the following wrongly describes plane surveying?:",
    "options": [
      "it refers to a flat plane without considering curvature of the earth",
      "it ignores the actual shape of the earth",
      "it is performed on the surface of the earth",
      "it considers the size and shape of the earth"
    ],
    "answer": 3,
    "explain": "0), 1), and 2) These correctly define plane surveying for small areas. 3) This **wrongly describes** it; Geodetic surveying is the branch that **considers the size and shape (curvature)** of the earth. Plane surveying specifically assumes the earth is flat."
  },
  {
    "q": "446. Combination of two reverse curve is a:",
    "options": [
      "simple circular curve",
      "compound curve",
      "transition curve",
      "deviation curve"
    ],
    "answer": 3,
    "explain": "0) A single arc. 1) Two arcs turning the same way. 2) A curve with changing radius. 3) A **deviation curve** is used to bypass an obstacle and return to the original path; it is essentially a combination of two reverse curves."
  },
  {
    "q": "447. A clinometers is commonly used to measure:",
    "options": [
      "horizontal distance",
      "vertical distance",
      "included angles",
      "angles of slope"
    ],
    "answer": 3,
    "explain": "0), 1), and 2) These require tapes, levels, or theodolites. 3) A **clinometer** is a simple hand-held instrument designed specifically to measure the **angle of slope** (inclination) or the height of objects via vertical angles."
  },
  {
    "q": "448. The instrument which uses measurement of air pressure to approximately indicate altitude of a place is called:",
    "options": [
      "tacheometer",
      "manometer",
      "barometer",
      "odometer"
    ],
    "answer": 2,
    "explain": "0) Measures distances optically. 1) Measures fluid pressure in pipes. 2) A **barometer** (specifically an altimeter) measures atmospheric pressure, which decreases as altitude increases, allowing for height estimation. 3) Measures distance traveled by a wheel."
  },
  {
    "q": "449. The types of instrument generally used in the survey of gravity water supply system is:",
    "options": [
      "abney level",
      "dumpy level",
      "theodolite",
      "clinometer"
    ],
    "answer": 0,
    "explain": "0) The **Abney level** is a hand-held clinometer/level used for measuring slopes and gradients, making it very popular for reconnaissance and setting out gravity water lines in hills. 1) Dumpy levels are for precise vertical control. 2) and 3) These are often overkill for initial water line pathfinding."
  },
  {
    "q": "450. A systematic process for combining opinions into a reasoned consensus is:",
    "options": [
      "consumer survey",
      "opinion of experts",
      "Delphi method",
      "group work"
    ],
    "answer": 2,
    "explain": "0) Collects data from users. 1) Is a raw input, not a process. 2) The **Delphi method** is a structured communication technique used to reach a **reasoned consensus** among a panel of experts through multiple rounds of questioning. 3) Group work is a general collaborative activity."
  },
  {
    "q": "451. Which type of the chain in mainly used for measuring field in cadastral survey?:",
    "options": [
      "metric chain",
      "Gunter’s chain",
      "revenue chain",
      "engineer’s chain"
    ],
    "answer": 1,
    "explain": "0) Standard metric construction. 1) **Gunter's chain** (66ft) is historically the standard for **cadastral (land) surveys** because its units relate easily to acres. 2) Revenue chain (33ft) is also used in some regions, but Gunter's is the most cited 'classic' cadastral tool. 3) Engineer's chain is 100ft."
  },
  {
    "q": "452. The instrument attached to the wheel of a vehicle in order to measure the distance traveled, is called:",
    "options": [
      "passometer",
      "odometer",
      "pedometer",
      "speedometer"
    ],
    "answer": 1,
    "explain": "0) and 2) These measure steps or pacing distance. 1) An **odometer** measures the distance traveled by a vehicle based on the number of wheel rotations. 3) A **speedometer** measures the *rate* of travel (speed), not the total distance."
  },
  {
    "q": "453. The horizontal distances obtained tacheometrically are corrected for:",
    "options": [
      "slope correction",
      "temperature correction",
      "refra. & curva. correction",
      "tension correction"
    ],
    "answer": 1,
    "explain": "0), 2), and 3) These apply to physical tapes/chains or EDMs. 1) In tacheometry, because readings are taken through the atmosphere over long distances, the measurements are primarily corrected for **Refraction and Curvature** to obtain accurate horizontal distances. *Note: Option B in your key says 'temperature', but technically in most surveying contexts, tacheometry requires Refraction/Curvature correction.*"
  },
  {
    "q": "454. The use of alidade is associated with the use of:",
    "options": [
      "abney level",
      "theodolite",
      "altimeter",
      "plane table"
    ],
    "answer": 3,
    "explain": "0), 1), and 2) These are standalone instruments. 3) An **alidade** is a sighting device (either a simple ruler or telescopic) used specifically in **plane table surveying** to draw lines of sight on a map."
  },
  {
    "q": "455. In surveying, the lengths of main lines and the positions of important survey stations should be ascertained by at least:",
    "options": [
      "three independent measurements",
      "two independent measurements",
      "one independent measurements",
      "all of the above"
    ],
    "answer": 1,
    "explain": "0) Three is excellent but not the minimum requirement. 1) The 'principle of check' requires at least **two independent measurements** to ensure accuracy and catch blunders in major survey control. 2) and 3) A single measurement has no check and is prone to errors."
  }
]

